# Groupby

#groupby allows you to group together rows based off of a column and perform an aggregate function on them.

In [1]:
import pandas as pd

In [4]:
data ={'Company':['HOYO','HOYO','WITS','WITS','MAPPA','MAPPA'],
       'Person':['Jerald','Luthor','Jod','Lorelei','Loki','Oniel'],
       'Sales':[200,300,250,300,180,220]}

In [5]:
df = pd.DataFrame(data)

In [6]:
df

  Company   Person  Sales
0    HOYO   Jerald    200
1    HOYO   Luthor    300
2    WITS      Jod    250
3    WITS  Lorelei    300
4   MAPPA     Loki    180
5   MAPPA    Oniel    220

In [8]:
#groupby company
byComp = df.groupby('Company')

In [9]:
byComp

In [10]:
byComp.mean()

         Sales
Company
HOYO     250.0
MAPPA    200.0
WITS     275.0

In [11]:
byComp.std()

             Sales
Company
HOYO     70.710678
MAPPA    28.284271
WITS     35.355339

In [12]:
byComp.sum()

         Sales
Company
HOYO       500
MAPPA      400
WITS       550

In [13]:
byComp.sum().loc['MAPPA']

Sales    400
Name: MAPPA, dtype: int64

In [14]:
#another method
df.groupby('Company').sum().loc['MAPPA']

Sales    400
Name: MAPPA, dtype: int64

In [15]:
df.groupby('Company').count()

         Person  Sales
Company
HOYO          2      2
MAPPA         2      2
WITS          2      2

In [16]:
#finding min value
df.groupby('Company').min()

         Person  Sales
Company
HOYO     Jerald    200
MAPPA      Loki    180
WITS        Jod    250

In [17]:
#finding max value
df.groupby('Company').max()

          Person  Sales
Company
HOYO      Luthor    300
MAPPA      Oniel    220
WITS     Lorelei    300

In [18]:
#describe method it will give you a bunch of information
df.groupby('Company').describe()

        Sales
        count   mean        std    min    25%    50%    75%    max
Company
HOYO      2.0  250.0  70.710678  200.0  225.0  250.0  275.0  300.0
MAPPA     2.0  200.0  28.284271  180.0  190.0  200.0  210.0  220.0
WITS      2.0  275.0  35.355339  250.0  262.5  275.0  287.5  300.0

In [19]:
#if you prefer column instead of actual index
df.groupby('Company').describe().transpose()

Company            HOYO       MAPPA        WITS
Sales count    2.000000    2.000000    2.000000
      mean   250.000000  200.000000  275.000000
      std     70.710678   28.284271   35.355339
      min    200.000000  180.000000  250.000000
      25%    225.000000  190.000000  262.500000
      50%    250.000000  200.000000  275.000000
      75%    275.000000  210.000000  287.500000
      max    300.000000  220.000000  300.000000

In [20]:
#if you want single company
df.groupby('Company').describe().transpose()['WITS']

Sales  count      2.000000
       mean     275.000000
       std       35.355339
       min      250.000000
       25%      262.500000
       50%      275.000000
       75%      287.500000
       max      300.000000
Name: WITS, dtype: float64